// Задача №20
// Напишите программу, которая принимает 
// на вход координаты двух точек и находит расстояние между ними в 2D пространстве.
int ReadData(string msg)
{
    Console.WriteLine(msg);
    int res = int.Parse(Console.ReadLine() ?? "0");
    return res;
}

double CalcLen2D(int x1, int y1, int x2, int y2)
{
    return Math.Sqrt(Math.Pow)


}